export const QuizQuestions = [
  {
    q: "아군 미드가 야스오인상황, 이떄 내가 픽해서 좋은 시너지가 나올 챔프는?",
    options: [
      {
        ans: "다이애나",
        score: 2,
      },
      {
        ans: "니달리",
        score: 1,
      },
      {
        ans: "그레이브즈",
        score: 0,
      },
    ],
  },
  {
    q: "당신은 탑입니다. 초반 풀캠이후 양팀 정글러가 바위게를 노리는 상황, 당신의 라인이 밀리고 있는 상황에서 당신이 할 선택은?",
    options: [
      {
        ans: "우선 최대한 라인을 정리한후 미드의 상황을 보고 합류한다.",
        score: 2,
      },
      {
        ans: "라인이 밀리고 있으므로 정글러에게 백핑을 찍어서 못간다고 전한다.",
        score: 1,
      },
      {
        ans: "정글러에게 바로 합류한다.",
        score: 0,
      },
    ],
  },
  {
    q: "당신은 미드입니다, 현재 정글러가 전령을 치고 있는 상황이고 바텀이 다이브 당하기 직전입니다. 이떄 해야할 판단은?",
    options: [
      {
        ans: "라인을 밀고 전령에 합류한다.",
        score: 3,
      },
      {
        ans: "바텀에 합류한다.",
        score: 0,
      },
      {
        ans: "전령에 합류한다.",
        score: 2,
      },
    ],
  },
  {
    q: "당신은 위쪽진형의 정글러입니다. 상성상 바텀은 이기는 상성, 미드는 갱킹에 유리한 챔피언, 탑은 리턴이 확실한 챔피언일때 어떤 동선을 짜야할까요?",
    options: [
      {
        ans: "리쉬 정버프 풀캠",
        score: 0,
      },
      {
        ans: "노리쉬 역버프",
        score: 4,
      },
      {
        ans: "노리쉬 정버프",
        score: 1,
      },
    ],
  },
  {
    q: "현재 적팀이 4용을 먹은상황이고, 바론과 장로가 동시에 젠됩니다. 하지만 당신팀이 글로벌 골드가 밀리고 있습니다 ,당신이 팀오더이고 이떄 내릴 판단은?",
    options: [
      {
        ans: "바론 빠르게 먹고 장로용으로 합류",
        score: 0,
      },
      {
        ans: "바론 먹고 집귀환",
        score: 1,
      },
      {
        ans: "장로에서 교전",
        score: 4,
      },
    ],
  },
  {
    q: "당신은 서포터입니다. 현재 게임시작후 7분20초 경과인 상황, 바텀이 리드중입니다. 이떄 당신의 판단은?",
    options: [
      {
        ans: "바텀이 이기고 있으므로 정글러를 불러서 봇다이브를 한다.",
        score: 2,
      },
      {
        ans: "라인을 먼저 민후 미드에 로밍을 간다.",
        score: 0,
      },
      {
        ans: "곧 있을 오브젝트를 위해 귀환한다.",
        score: 4,
      },
    ],
  },
  {
    q: "당신의 팀의 원딜입니다. 바텀 라인전을 이기고 있는 상황인데 이떄 당신이 해야할 선택은?",
    options: [
      {
        ans: "포탑을 빠르게 부수고 다른라인과 스왑",
        score: 4,
      },
      {
        ans: "상대 바텀이 올때마다 킬을 딸 수 있으므로 게속 킬을 딴다.",
        score: 2,
      },
      {
        ans: "최대한 라인프리징을 해서 상대방의 라인을 태운다.",
        score: 0,
      },
    ],
  },
  {
    q: "게임초반 정글러의 3렙갱으로 ",
    options: [
      {
        ans: "우선 최대한 라인을 정리한후 미드의 상황을 보고 합류한다.",
        score: 6,
      },
      {
        ans: "라인이 밀리고 있으므로 정글러에게 백핑을 찍어서 못간다고 전한다.",
        score: 2,
      },
      {
        ans: "정글러가 도움이 필요하다. 바로 합류한다.",
        score: 0,
      },
    ],
  },
  {
    q: "당신은 탑입니다. 초반 풀캠이후 양팀 정글러가 바위게를 노리는 상황, 당신의 라인이 밀리고 있는 상황에서 당신이 할 선택은?",
    options: [
      {
        ans: "우선 최대한 라인을 정리한후 미드의 상황을 보고 합류한다.",
        score: 6,
      },
      {
        ans: "라인이 밀리고 있으므로 정글러에게 백핑을 찍어서 못간다고 전한다.",
        score: 1,
      },
      {
        ans: "정글러가 도움이 필요하다. 바로 합류한다.",
        score: 0,
      },
    ],
  },
  {
    q: "당신은 탑입니다. 초반 풀캠이후 양팀 정글러가 바위게를 노리는 상황, 당신의 라인이 밀리고 있는 상황에서 당신이 할 선택은?",
    options: [
      {
        ans: "우선 최대한 라인을 정리한후 미드의 상황을 보고 합류한다.",
        score: 6,
      },
      {
        ans: "라인이 밀리고 있으므로 정글러에게 백핑을 찍어서 못간다고 전한다.",
        score: 3,
      },
      {
        ans: "정글러가 도움이 필요하다. 바로 합류한다.",
        score: 0,
      },
    ],
  },
];
