export const QuizResults = [
  {
    tierPic: "",
    tier: "Bronze",
    title: "청렴결백한 논리주의자, 협곡의 소금형",
    main: "",
  },
  {
    tierPic: "",
    tier: "Silver",
    title: "만능 재주꾼, 백과사전형",
    main: "1. 타인을 잘 도우며 그들의 경험을 다른 이들과 공유하는 것을 좋아하기도 하는 ISTP는 특히나 그들이 아끼는 사람일수록 더욱 그러합니다. 이들이 인구의 고작 5%만이 차지합니다. \n\n 2. 이 유형의 사람들은 정글을 많이가는 편입니다. \n\n 3. 논리적인 판단력을 근거로 팀원들에게 오더를 내리는 사람들이 많습니다. ",
  },
  {
    tierPic: "",
    tier: "Gold",
    title: "용감한 수호자, 임금 뒷편의 권력형",
    main: "1.ISFJ 특징 유형 성격의 소유자는 조용하고 차분하며 따뜻하고 친근합니다. \n\n 2. 이 유형의 사람들은 서포터를 많이가는 편입니다. \n\n 3. 애정이 많고 인내력이 강하며 유틸형 서포터나 유틸형 챔피언 (ex)쉔)을자주 합니다. ",
  },
  {
    tierPic: "",
    tier: "Platinum",
    title: "호기심 많은 예술가, 성인군자형",
    main: "1. 말없이 다정하고 온화하며 사람들에게 친절하고 상대방을 잘 알게 될 때까지 내면의 모습이 잘 보이지 않습니다. \n\n 2. 이 유형의 사람들은 서포터를 많이가는 편입니다. \n\n 3. 타인의 감정에 민감한편이며 채팅창에서 불의를 피하지 않습니다. ",
  },
  {
    tierPic: "",
    tier: "Diamond",
    title: "용의주도한 전략가, 과학자형",
    main: "1. INTJ의 지식을 향한 갈증은 어릴 적부터 두드러지게 나타나는데, 때문에 건축가형 사람은 어릴 때 ‘책벌레’라는 소리를 자주 듣습니다. \n\n 2. 이 유형의 사람들은 미드를 많이가는 편입니다. \n\n 3. 남들의 말에는 개의치 않고, 본인의 플레이를 성공해 캐리하거나 실패해서 게임에서 지는등 극과극의 플레이를 자주합니다. ",
  },
  {
    tierPic: "",
    tier: "Master",
    title: "논리적인 사색가, 아이디어뱅크형",
    main: "1. INTP 특징은 조용하고 과묵하며 논리와 분석으로 문제를 해결하기를 좋아합니다. \n\n 2. 이 유형의 사람들은 탑을 많이가는 편입니다. \n\n 3. 16가지 유형중 창의적 지능과 논리면에서 가장 뛰어나 하이리스크 하이리턴의 가능성을 항상 열어둡니다. ",
  },
  {
    tierPic: "",
    tier: "Challenger",
    title: "선의의 옹호자, 예언자형",
    main: "1. INFJ 특징은 인내심이 많고 통찰력과 직관력이 뛰어나며 화합을 추구합니다. \n\n 2. 이 유형의 사람들은 정글을 많이가는 편입니다. \n\n 3. 말없이 플레이로 보여줘 팀원들에게 영향을 미치며, 게임속 채팅은 신경을 잘 안쓰는 편입니다. ",
  },
];
